"""
Следующая задача достаточно сложная. Поэтому чуть-чуть отдыха не повредит. Выпейте чашку чая, отдохните,
а затем продолжайте!

В прошлом параграфе мы уже решали задачу о нахождении палиндрома. Давайте вспомним её суть:

Палиндром — это число, слово или фраза, которые читаются одинаково слева направо и справа налево.

Напишите программу, которая проверяет, является ли заданное число палиндромом. В этот раз будем использовать
цикл while.

Формат ввода
Одно натуральное число

Формат вывода
YES если число является палиндромом, иначе NO.
"""

