"""
Давайте передохнём от автоматизации и сделаем что-то действительно интересное.

Формат ввода
Одно натуральное число N

Формат вывода
N строк с фразой: "Купи слона!"
"""
number_of_lines = int(input())
print("Купи слона!\n" * number_of_lines)